
package fourpointone;

public class FourPointOne {
    
    public static void main(String[] args) {
        double i = 10;
        double j = 100;
        double k = 1000;
        
        //ถ้า i หาร j ลงตัว ให้ k มีค่าเป็น 2 เท่าของ i
        if(j%i == 0){
            k = i*2;
        }
        
        //ถ้า i เป็นสี่เท่าของ j ให้ k มีค่าเป็นครึ่งหนึ่งของ i
        if(i == j*4){
            k = i/2;
        }
        
        //ถ้า i หรือ j ตัวใดตัวหนึ่ง (ไม่ใช่ทั้งสองตัว) เป็นศูนย์ ให้ตัวที่เป็นศูนย์มีค่าเท่ากับตัวที่ไม่ใช่ศูนย์
        if(i == 0){
            i = j;
        }
        else{
            j = i;
        }
        
        //ถ้า i เป็นเลขคี่ที่ไม่น้อยกว่า j ให้เพิ่มทั้ง i และ j อีก 1
        if (i%2 != 0){
            if(i>j){
                i++;
                j++;
            }
        }

        /*ถ้า i เป็นจำนวนเต็มบวกที่เป็นเลขคู่ที่มีค่าไม่เกิน 20 แต่ต้องไม่ใช่ 8 และ 10 ให้ k มีค่า
          เพิ่มเติมจากเดิมอีกสองเท่า ถ้า i น้อยกว่า 10 ไม่เช่นนั้นให้ k ลดลงจากเดิมครึ่งหนึ่ง */
        if(i%2 == 0){
            if(i<=20 && i!=8 && i!=10){
                if(i<10){
                    k = k + (k*2);
                }
                else{
                    k = k/2;
                }
            }
         }
        
    }
}
